eisup_2019_docmng_integration/src/AccumulationRegisters/ttk_ОстаткиЛимитовПоДоговорам/ttk_ОстаткиЛимитовПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ttk_ОстаткиЛимитовПоДоговорам</name>
  <resources>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ttk_РаспоряжениеНаЗакупку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ttk_ЛимитыПоДоговорам/ttk_ЛимитыПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ttk_ЛимитыПоДоговорам</name>
  <resources>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </resources>
  <attributes>
    <name>МетодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ttk_РаспоряжениеНаЗакупку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/CommonModules/ttk_КонтрольЛимитовПоДоговорам/Module.bsl
Процедура ttk_КонтрольЛимитовПоДоговорамОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Константы.ttk_ИспользоватьКонтрольЛимитовПоДоговорам.Получить() = Истина И Источник.ДоговорКонтрагента.ttk_ИспользоватьКонтрольЛимитов = Истина Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(ttk_ОстаткиЛимитовПоДоговорамОстатки.СуммаБезНДСОстаток) КАК СуммаБезНДС,
			|	СУММА(ttk_ОстаткиЛимитовПоДоговорамОстатки.СуммаНДСОстаток) КАК СуммаНДС,
			|	СУММА(ttk_ОстаткиЛимитовПоДоговорамОстатки.СуммаСНДСОстаток) КАК СуммаСНДС,
			|	ttk_ОстаткиЛимитовПоДоговорамОстатки.Распоряжение,
			|	ttk_ЛимитыПоДоговорам.Статус,
			|	ttk_ЛимитыПоДоговорам.НачалоПериода,
			|	ВЫБОР
			|		КОГДА ttk_ЛимитыПоДоговорам.ОкончаниеПериода = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА &Дт
			|		ИНАЧЕ ttk_ЛимитыПоДоговорам.ОкончаниеПериода
			|	КОНЕЦ КАК ОкончаниеПериода
			|ИЗ
			|	РегистрНакопления.ttk_ОстаткиЛимитовПоДоговорам.Остатки(&Дт, ) КАК ttk_ОстаткиЛимитовПоДоговорамОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ttk_ЛимитыПоДоговорам КАК ttk_ЛимитыПоДоговорам
			|		ПО ttk_ОстаткиЛимитовПоДоговорамОстатки.Распоряжение = ttk_ЛимитыПоДоговорам.Распоряжение
			|			И (&Дт МЕЖДУ НАЧАЛОПЕРИОДА(ttk_ЛимитыПоДоговорам.НачалоПериода, ДЕНЬ) И ВЫБОР
			|				КОГДА ttk_ЛимитыПоДоговорам.ОкончаниеПериода = ДАТАВРЕМЯ(1, 1, 1)
			|					ТОГДА &Дт
			|				ИНАЧЕ ttk_ЛимитыПоДоговорам.ОкончаниеПериода
			|			КОНЕЦ)
			|ГДЕ
			|	ttk_ОстаткиЛимитовПоДоговорамОстатки.Организация = &Организация
			|	И ttk_ОстаткиЛимитовПоДоговорамОстатки.Контрагент = &Контрагент
			|	И ttk_ОстаткиЛимитовПоДоговорамОстатки.Договор = &Договор
			|
			|СГРУППИРОВАТЬ ПО
			|	ttk_ОстаткиЛимитовПоДоговорамОстатки.Распоряжение,
			|	ttk_ЛимитыПоДоговорам.Статус,
			|	ttk_ЛимитыПоДоговорам.НачалоПериода,
			|	ВЫБОР
			|		КОГДА ttk_ЛимитыПоДоговорам.ОкончаниеПериода = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА &Дт
			|		ИНАЧЕ ttk_ЛимитыПоДоговорам.ОкончаниеПериода
			|	КОНЕЦ";
		Запрос.УстановитьПараметр("Организация", Источник.Организация);
		Запрос.УстановитьПараметр("Контрагент", Источник.Контрагент);
		Запрос.УстановитьПараметр("Договор", Источник.ДоговорКонтрагента);
		Запрос.УстановитьПараметр("Дт", Источник.Дата);
		
		Выборка = Запрос.Выполнить();		
		Если Выборка.Пустой() Тогда
			Сообщить("По договору '" + Строка(Источник.ДоговорКонтрагента) + "' нет ни одного действующего распоряжения на закупку.");
			Отказ = Истина;
			Возврат;			
		КонецЕсли;
		
		Результат = Выборка.Выбрать();
		Пока Результат.Следующий() Цикл
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Или ТипЗнч(Источник) = Тип("ДокументОбъект.ПолучениеУслугПоПереработке") Тогда
		ВсегоНДС = УчетНДС.ПолучитьНДСДокумента(Источник);
		Источник.Движения.ttk_ОстаткиЛимитовПоДоговорам.Записывать = Истина;
		Движение = Источник.Движения.ttk_ОстаткиЛимитовПоДоговорам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Источник.Дата;
		Движение.Организация = Источник.Организация;
		Движение.Контрагент = Источник.Контрагент;
		Движение.Договор = Источник.ДоговорКонтрагента;
		Движение.СуммаНДС = ВсегоНДС;
		Движение.СуммаСНДС = Источник.СуммаДокумента;
		Движение.СуммаБезНДС = ?(Источник.СуммаВключаетНДС, (Движение.СуммаСНДС - Движение.СуммаНДС), (Движение.СуммаСНДС - Движение.СуммаНДС));
	КонецЕсли;
	
КонецПроцедуры
